[
    {
        "name":"Northern Corn Leaf Blight",
        "description":"Northern Corn Leaf Blight, often simply called “blight,” is caused by the fungus Exserohilum turcicum. The disease typically appears as long, elliptical gray-green lesions on leaves that later turn tan or brown. These lesions can coalesce, forming large necrotic areas that severely reduce the plant’s photosynthetic capacity. Under warm (22–30 °C) and humid conditions, spores readily form on infected tissue and spread via wind and splashing rain. Severe infections during the vegetative stages can stunt growth and reduce ear fill, while infections during grain-filling can dramatically cut yield. Management combines resistant hybrids, crop rotation (to break the disease cycle), and timely fungicide applications when the disease first appears."
    },
    {
        "name":"Gray Leaf Spot",
        "description":"Gray Leaf Spot is caused by the fungus Cercospora zeae-maydis (formerly Cercospora zeae-maydis and Phaeosphaeria maydis). It shows up as rectangular, tan to gray lesions bounded by leaf veins. Early lesions may be small and dark, but in a few days they expand into 1–5 cm long spots that merge into large dead areas. The disease thrives in warm (20–29 °C), moist conditions and often develops rapidly in dense canopies or after continuous corn planting. Yield losses result from reduced photosynthesis and premature leaf senescence. Control relies on using resistant varieties, rotating to non-host crops (e.g., soybean), tillage to bury infected residue, and fungicide sprays when disease pressure is high."
    },
    {
        "name":"Common Rust",
        "description":"Common Rust of maize is caused by the obligate fungus Puccinia sorghi. It is characterized by small, round to oval pustules (uredinia) that erupt on both leaf surfaces, releasing cinnamon-to-reddish spores. Unlike southern rust, the pustules are more scattered and the spores darker. Infections can occur from early vegetative stages through grain fill, and severe rust can cause premature leaf death, reducing kernel weight and overall yield. Rust develops best under moderate temperatures (15–25 °C) with high humidity or dew periods. Management includes planting rust-resistant hybrids, removing volunteer maize (to reduce initial inoculum), and applying fungicides when pustules first appear, especially in hybrids known to be susceptible."
    },
    {
        "name":"Downy Mildew",
        "description":"Caused by the fungus Peronosclerospora maydis, downy mildew initially appears as pale green to yellow streaks running alongside leaf veins. In humid conditions you may see white, fuzzy fungal growth on the underside of those leaves. Young plants can be severely stunted or develop excessive side‐shoots (“tillers”), and infected leaves often become deformed as the disease progresses."
    },
    {
        "name":"Maize Streak Virus",
        "description":"Transmitted by small leafhoppers (Cicadulina spp.), maize streak virus produces bright yellow to light green streaks on young leaves that follow the vein pattern. Infected plants may exhibit twisted or curling foliage, and heavy infections early in the season can lead to significant stunting and poor ear development, often reducing yield dramatically.",
    },
    {
        "name":"Fusarium Ear and Stalk Rots",
        "description":"A complex of Fusarium species infects both the ears and the stem. On the ear you’ll see white to pinkish mold between kernels—usually beginning at the tip or husk edge—with affected kernels shriveling and discoloring. On the stalk it shows up as brownish, sunken lesions in the lower internodes; severely rotted stalks weaken and often lodge before harvest."
    }
]